// 장바구니 도메인
const 장바구니목록 = [

    {
        장바구니번호 : 1,
        회원번호 : 1,
        제품번호 : 1,
        수량 : 2,
        샷추가 : 1,
        사이즈 : "Regular",
        주문방식 : "먹고가기",
        온도 : "Ice"
    },

    {
        장바구니번호 : 2,
        회원번호 : 1,
        제품번호 : 3,
        수량 : 1,
        샷추가 : 0,
        사이즈 : "Large",
        주문방식 : "가져가기",
        온도 : "Ice"
    },

    {
        장바구니번호 : 3,
        회원번호 : 1,
        제품번호 : 3,
        수량 : 4,
        샷추가 : 1,
        사이즈 : "Large",
        주문방식 : "가져가기",
        온도 : "Ice"

    }

];