// 문제 1: 과일 목록 정리
//  입력 -> 처리 -> 출력
let fruitList = [ '사과', '바나니' ] // 0. 미리 제공된 자료
let 과일이름 = prompt() // 1. 입력 2. 저장
// 3. 처리
// 쓰다가 말았음

// 문제 2: 성별에 따른 색상 지정
// 주민등록번호 13자리를 문자열로 입력받습니다. 
let 주민등록번호 = prompt()
let 결과 = 주민등록번호[7] == 1 || 주민등록번호[7] == 3 // 문자열은 배열 취급 , 문자열도 인덱스 가능
// 4. 출력 (분기)
if( 결과 ){ console.log{ 'blue' } }
ele { console.log('red')} 

// 문제 3, 4는 혼자 해보거라

// 문제 5: 세 수 중 가장 큰 수 찾기
let 정수1 = Number( ' 정수1: ')
let 정수2 = Number( ' 정수1: ')
let 정수3= Number( ' 정수1: ') // 1, 입력받기 2. 저장하기
// 3. 처리, 가장 큰 수 찾기
// 3-1: max 변수 선언 (가장 큰 수 담는 변수)
let max = 정수1 // 첫번째 값을 가장 큰 수 시작!
// 3-2: 두번째 값이 max 보다 큰지 확인, if~else if 아닌 if?
if( max  < 성수2 ) {max = 정수2}
if( max < 정수3 ) {max = 정수3}
console.log(max)







// 스왑(두 변수간 값 교체) *변수특징: 하나의 값 저장



